Repository: VuTungTam/hospital
Catalog: Hospital.Resource/Properties/Resources.*.resx
Languages: vi_vn

# Account.RegSuccessedPleaseCheckEmail
source: Account registration successful, please check your email, if not found, please check spam
vi_vn: Đăng ký tài khoản thành công, vui lòng kiểm tra email. Nếu không thấy, hãy thử kiểm tra spam/thư rác

# Account.SendEmailSuccessed
source: Email has been sent successfully, please check your email, if not found, please check spam
vi_vn: Đã gửi thành công, vui lòng kiểm tra email. Nếu không thấy, hãy thử kiểm tra spam/thư rác

# Account.VerificationCodeHasExpired
source: Verification code has expired. Please contact the admin to receive the new code!
vi_vn: Mã xác nhận đã hết hạn. Vui lòng liên hệ với quản trị viên để lấy mã mới!

# Account.VerificationInfomationIsNotValid
source: Verify failed, the verify information is not valid
vi_vn: Xác thực thất bại, thông tin không hợp lệ

# Authentication.AccountHasNotBeenVerified
source: The account has not been verified
vi_vn: Tài khoản chưa được xác thực

# Account.IsBanned
source: The account is banned
vi_vn: Tài khoản đã bị khóa

# Account.IsInactive
source: The account is inactive
vi_vn: Tài khoản đã ngừng hoạt động

# Authentication.AccountMustNotBeEmpty
source: Account must not be empty
vi_vn: Tài khoản không được để trống

# Account.NotFound
source: Not found this user
vi_vn: Không tìm thấy người dùng này

# Authentication.DateOfBirthIsNotValid
source: Date of birth is not valid
vi_vn: Ngày sinh không hợp lệ

# Authentication.DateOfBirthMustNotBeEmpty
source: Date of birth must not be empty
vi_vn: Ngày sinh không được để trống

# Account.EmailAlreadyExists
source: This email already exist on our system. Please use another email and try again
vi_vn: Email đã tồn tại trên hệ thống

# CommonMessage.EmailIsNotValid
source: Email is not valid
vi_vn: Email không hợp lệ

# Authentication.EmailMustNotBeEmpty
source: Email must not be empty
vi_vn: Email không được để trống

# Authentication.FacebookInformationIsNotValid
source: Facebook authenticate information is not valid
vi_vn: Thông tin đăng nhập facebook không hợp lệ

# Authentication.FirstNameMustNotBeEmpty
source: First name must not be empty
vi_vn: Tên không được để trống

# Authentication.FullNameMustNotBeEmpty
source: Full name must not be empty
vi_vn: Họ và tên không được để trống

# Authentication.GithubInformationIsNotValid
source: The Github information is not valid
vi_vn: Thông tin Github không hợp lệ

# Authentication.GoogleInformationIsNotValid
source: The Google information is not valid
vi_vn: Thông tin Google không hợp lệ

# Authentication.LoginInformationIsIncorrect
source: The account or password you entered is incorrect
vi_vn: Thông tin đăng nhập không chính xác

# Authentication.NotPermission
source: Not permission!
vi_vn: Bạn không có quyền để thực hiện hành động này

# Authentication.PasswordMustNotBeEmpty
source: Password must not be empty
vi_vn: Mật khẩu không được để trống

# Account.PhoneAlreadyExists
source: This phone number already exist on our system. Please use another phone number and try again
vi_vn: SĐT đã tồn tại trên hệ thống

# Authentication.PhoneIsNotValid
source: Phone is not valid
vi_vn: SĐT không hợp lệ

# Authentication.PhoneMustNotBeEmpty
source: Phone must not be empty
vi_vn: SĐT không được để trống

# Authentication.PasswordAndRepeatPasswordMustSame
source: Password and Confirm password must be the same
vi_vn: Mật khẩu và mật khẩu xác nhận phải giống nhau

# Authentication.RefreshTokenIsNotValid
source: Refresh Token is not valid
vi_vn: Refresh Token không hợp lệ

# Authentication.RefreshTokenMustNotBeEmpty
source: RefreshToken must not be empty
vi_vn: RefreshToken không được để trống

# Authentication.RepeatPasswordMustNotBeEmpty
source: Repeat password must not be empty
vi_vn: Mật khẩu xác nhận không được để trống

# Authentication.TenantNotFound
source: Tenant not found
vi_vn: Không tìm thấy tenant

# Authentication.Unauthorized
source: You are not authorized!
vi_vn: Bạn chưa được xác thực vào hệ thống

# Authentication.UserIdMustNotBeEmpty
source: UserId must not be empty
vi_vn: UserId không được để trống

# Authentication.UserAlreadyExists
source: This user name already exist on our system. Please choose another user name and try again
vi_vn: Tài khoản đã tồn tại trên hệ thống

# Authentication.UserDoesNotExist
source: User does not exist
vi_vn: Người dùng không tồn tại

# CommonMessage.BadQueryParameters
source: Query params are not valid
vi_vn: Tham số không hơp lệ

# CommonMessage.DataDoesNotExistOrWasDeleted
source: This data does not exist or was deleted
vi_vn: Bản ghi không tồn tại hoặc đã bị xóa

# CommonMessage.DataWasDeletedOrNotPermission
source: This data has been deleted or you do not have permission
vi_vn: Dữ liệu này đã bị xóa hoặc bạn không có quyền

# CommonMessage.RecordIsUpdating
source: This record is updating by other user. Please wait and reload to see new data!
vi_vn: Dữ liệu đang được cập nhật bởi người khác. Vui lòng đợi và tải lại trang để thấy dữ liệu mới!

# CommonMessage.IdIsNotValid
source: Id is not valid
vi_vn: ID không hợp lệ

# CommonMessage.ListIdsMustNotBeEmpty
source: List records need remove must not be empty
vi_vn: Danh sách bản ghi cần xóa không được để trống

# CommonMessage.NotSupport3pTools
source: Not support 3p tool
vi_vn: Không hỗ trợ phần mềm thứ 3

# CommonMessage.PayloadIsNotValid
source: Request's payload is not valid
vi_vn: Gói tin không hợp lệ

# CommonMessage.SystemErrorOccurred
source: An error has occurred in the system. Please try again in a few minutes
vi_vn: Lỗi hệ thống. Vui lòng thử lại sau ít phút

# SocialNetwork.LinkMustNotBeEmpty
source: Social network's link is not empty
vi_vn: Link mạng xã hội không được để trống

# SocialNetwork.LogoMustNotBeEmpty
source: Social network's logo is not empty
vi_vn: Logo mạng xã hội không được để trống

# SocialNetwork.NameMustNotBeEmpty
source: Social network's name is not empty
vi_vn: Tên mạng xã hội không được để trống

# Utilities.ImageIsNotValid
source: Image is not valid
vi_vn: Ảnh không hợp lệ

# Account.PasswordContainsAtLeastNCharacters
source: Contains at least {0} character(s)
vi_vn: Chứa ít nhất {0} ký tự

# Account.PasswordHasAtLeast1LowercaseLetter
source: Have at least 1 lowercase letter
vi_vn: Có ít nhất 1 chữ cái viết thường

# Account.PasswordHasAtLeast1Number
source: Have at least 1 number
vi_vn: Có ít nhất 1 số

# Account.PasswordHasAtLeast1SpecialCharacter
source: Have at least 1 special character
vi_vn: Có ít nhất 1 ký tự đặc biệt

# Account.PasswordHasAtLeast1UppercaseLetter
source: Have at least 1 uppercase letter
vi_vn: Có ít nhất 1 chữ cái viết hoa

# Account.PasswordIsNotStrongEnough
source: Password is not strong enough
vi_vn: Mật khẩu chưa đủ mạnh

# Account.PasswordMustIncludeTheFollowingElements
source: Password must include the following elements
vi_vn: Mật khẩu phải bao gồm các yếu tố sau

source: Account was deleted
vi_vn: Tài khoản đã bị xóa

# Account.EmailHasBeenSentPreviously
source: Email has been sent previously, please try again later
vi_vn: Đã gửi mã xác minh, vui lòng thử lại sau ít phút

# Account.NewPasswordMustNotBeEmpty
source: New password must not be empty
vi_vn: Mật khẩu mới không được để trống

# Account.OldPasswordIsIncorrect
source: Old password is incorrect
vi_vn: Mật khẩu cũ không chính xác

# Account.OldPasswordMustNotBeEmpty
source: Old password must not be empty
vi_vn: Mật khẩu cũ không được để trống

# Account.PleaseWaitUntil
source: Please wait until <strong>{0}</strong> to resend
vi_vn: Vui lòng chờ tới <strong>{0}</strong> để có thể gửi lại

# Account.VerificationCodeIsExpired
source: Verification code is expired
vi_vn: Mã xác nhận đã hết hạn

# Account.VerificationCodeIsNotValid
source: Verification code is not valid
vi_vn: Mã xác nhận không chính xác

# Account.VerificationCodeIsNotValidOrExpired
source: Verification code is not valid or expired
vi_vn: Mã xác nhận không chính xác hoặc đã hết hạn

# Role.Receptionist
source: Receptionist
vi_vn: Lễ tân

# Roles.Customer
source: Customer
vi_vn: Khách hàng

# Roles.Doctor
source: Doctor
vi_vn: Bác sĩ

# Roles.SuperAdmin
source: Admin
vi_vn: Quản trị hệ thống

# CommonMessage.OtpIsNotValidOrExpired
source: OTP is not valid or expired
vi_vn: OTP không hợp lệ hoặc đã hết hạn

# Account.EmailAlreadyVerified
source: Email already verified
vi_vn: Email đã được xác thực rồi

# Account.HasBeenForcedToLogout
source: The account has been forced to log out
vi_vn: Tài khoản bị buộc đăng xuất

# Account.CodeAlreadyExists
source: This code already exist on our system
vi_vn: Mã đã tồn tại trên hệ thống

# Roles.OneOrMoreRolesNotFound
source: One or more roles were not found. Please check again
vi_vn: Tồn tại vai trò không có trong hệ thống. Vui lòng kiểm tra lại

# Roles.CannotExist
source: The {0} role cannot exist
vi_vn: Không thể có vai trò là {0}

# Account.CannotUpdateEmailVerified
source: The email cannot be changed because it has been verified
vi_vn: Không thể thay đổi email vì email đã được xác minh

# Account.CannotUpdatePhoneVerified
source: The phone cannot be changed because it has been verified
vi_vn: Không thể thay đổi SĐT vì SĐT đã được xác minh

# Articles.ContentMustNotBeEmpty
source: Content must not be empty
vi_vn: Nội dung không được để trống

# Articles.ImageMustNotBeEmpty
source: Image must not be empty
vi_vn: Ảnh không được để trống

# Articles.TitleMustNotBeEmpty
source: Title must not be empty
vi_vn: Tiêu đề không được để trống

# TeamInfo.ImagesMustNotBeEmpty
source: Images must not be empty
vi_vn: Ảnh không được để trống

# Articles.PostDateIsNotValid
source: Post date is not valid
vi_vn: Ngày đăng không hợp lệ

# Articles.IsNotActive
source: Article is not active
vi_vn: Bài đăng không hoạt động

# Articles.Posted
source: This article already posted
vi_vn: Bài đã đăng rồi

# Services.ContentMustNotBeEmpty
source: Content must not be empty
vi_vn: Nội dung không được để trống

# Services.ImageIsNotValid
source: Image is not valid
vi_vn: Ảnh không hợp lệ

# Services.NameMustNotBeEmpty
source: Service name must not be empty
vi_vn: Tên dịch vụ không được để trống

# Services.StatusIsInThisStatusAlready
source: Service is in this status already
vi_vn: Dịch vụ đang ở trạng thái này rồi

# WebImages.StatusIsInThisStatusAlready
source: Image is in this status already
vi_vn: Ảnh đang ở trạng thái này rồi

# Articles.ContentEnglishMustNotBeEmpty
source: Content in English must not be empty
vi_vn: Nội dung trong tiếng Anh không được để trống

# Articles.TitleEnglishMustNotBeEmpty
source: Title in English must not be empty
vi_vn: Tiêu đề trong tiếng Anh không được để trống

# Services.ContentEnglishMustNotBeEmpty
source: Content in English must not be empty
vi_vn: Nội dung trong tiếng Anh không được để trống

# Services.NameEnglishMustNotBeEmpty
source: Service name in English must not be empty
vi_vn: Tên dịch vụ trong tiếng Anh không được để trống

# Services.AnswerMustNotBeEmpty
source: Answer {0} must not be empty
vi_vn: Câu trả lời số {0} không được để trống

# Services.questionMustNotBeEmpty
source: Question {0} must not be empty
vi_vn: Câu hỏi số {0} không được để trống

# Contacts.EmailsContainNotValid
source: The list includes invalid emails
vi_vn: Danh sách bao gồm email không hợp lệ

# Contacts.PhonesContainNotValid
source: The list contains invalid phone numbers
vi_vn: Danh sách bao gồm số điện thoại không hợp lệ

# Contacts.PhoneMustNotBeEmpty
source: Phone must not be empty
vi_vn: Số điện thoại không được để trống

# Contacts.DistrictIsNotValid
source: District is not valid
vi_vn: Quận/huyện không hợp lệ

# Contacts.EmailMustNotBeEmpty
source: Email must be not empty
vi_vn: Email không được để trống

# Contacts.ProvinceIsNotValid
source: Province is not valid
vi_vn: Tỉnh/thành không hợp lệ

# Contacts.WardIsNotValid
source: Ward is not valid
vi_vn: Xã/phường không hợp lệ

# CommonMessage.SlugIsNotValid
source: The slug is not valid
vi_vn: Slug không hợp lệ

# Gender.Female
source: Female
vi_vn: Nữ

# Gender.Male
source: Male
vi_vn: Nam

# Gender.None
source: --Not specified--
vi_vn: --Không xác định--

# DoctorTitle.Ths
source: Master
vi_vn: Thạc sĩ

# DoctorTitle.TS
source: PhD
vi_vn: Tiến sĩ

# DoctorTitle.TSKH
source: Doctor of Science
vi_vn: Tiến sĩ khoa học

# DoctorDegree.PSG
source: Associate Professor
vi_vn: Phó giáo sư

# DoctorDegree.GS
source: Professor
vi_vn: Giáo sư

# DoctorRank.BS
source: Doctor
vi_vn: Bác sĩ

# DoctorRank.BSCKI
source: Specialist Doctor Level I
vi_vn: Bác sĩ chuyên khoa I

# DoctorRank.BSNT
source: Resident Doctor
vi_vn: Bác sĩ nội trú

# DoctorRank.BSCKII
source: Specialist Doctor Level II
vi_vn: Bác sĩ chuyên khoa II

# Infor.None
source: No data
vi_vn: Chưa có thông tin
